WITH RECURSIVE "ИЕРАРХИЯ" AS (
    SELECT
        "Н_ВЕДОМОСТИ"."ИД",
        "Н_ВЕДОМОСТИ"."ВЕД_ИД",
        CAST("Н_ВЕДОМОСТИ"."ИД" AS TEXT) AS "ПУТЬ"
    FROM
        "Н_ВЕДОМОСТИ"
    WHERE
        "Н_ВЕДОМОСТИ"."ВЕД_ИД" IS NULL
    UNION
    q
    SELECT
        "ДЕТ_ВЕДОМОСТИ"."ИД",
        "ДЕТ_ВЕДОМОСТИ"."ВЕД_ИД",
        CONCAT("РОД_ВЕДОМОСТИ"."ПУТЬ", '<-', "ДЕТ_ВЕДОМОСТИ"."ИД")
    FROM
        "Н_ВЕДОМОСТИ" "ДЕТ_ВЕДОМОСТИ"
        INNER JOIN "ИЕРАРХИЯ" "РОД_ВЕДОМОСТИ" ON "РОД_ВЕДОМОСТИ"."ИД" = "ДЕТ_ВЕДОМОСТИ"."ВЕД_ИД"
)
SELECT
    *
FROM
    "ИЕРАРХИЯ"
WHERE 
    "ИЕРАРХИЯ"."ВЕД_ИД" IS NOT NULL
ORDER BY
    "ИЕРАРХИЯ"."ПУТЬ" DESC;