WITH "УЧЕНИКИ_СО_СР_ОЦЕНКАМИ" AS (
    SELECT
        "УЧЕНИКИ_ГРУПП"."ИД" "УЧЕНИК_ИД",
        "ГРУППА",
        "ФАМИЛИЯ",
        "ИМЯ",
        "ОТЧЕСТВО",
        AVG(
            CASE
                WHEN "Н_ВЕДОМОСТИ"."ОЦЕНКА" IN ('2', '3', '4', '5') THEN CAST("Н_ВЕДОМОСТИ"."ОЦЕНКА" AS INTEGER)
                ELSE 2
            END
        ) AS "СР_ОЦЕНКА"
    FROM
        (
            SELECT
                "ИД",
                "ЧЛВК_ИД",
                "ГРУППА"
            FROM
                "Н_УЧЕНИКИ"
            WHERE
                "Н_УЧЕНИКИ"."ГРУППА" IN ('3100', '4100')
        ) as "УЧЕНИКИ_ГРУПП"
        INNER JOIN "Н_ЛЮДИ" ON "Н_ЛЮДИ"."ИД" = "УЧЕНИКИ_ГРУПП"."ЧЛВК_ИД"
        INNER JOIN "Н_ВЕДОМОСТИ" ON "Н_ВЕДОМОСТИ"."ЧЛВК_ИД" = "УЧЕНИКИ_ГРУПП"."ЧЛВК_ИД"
    GROUP BY
        "УЧЕНИКИ_ГРУПП"."ИД",
        "ГРУППА",
        "ФАМИЛИЯ",
        "ИМЯ",
        "ОТЧЕСТВО"
)
SELECT
    "УЧЕНИК_ИД",
    "ГРУППА",
    "ФАМИЛИЯ",
    "ИМЯ",
    "ОТЧЕСТВО",
    "СР_ОЦЕНКА"
FROM
    "УЧЕНИКИ_СО_СР_ОЦЕНКАМИ" "УЧЕНИКИ_4100"
WHERE
    "УЧЕНИКИ_4100"."СР_ОЦЕНКА" < (
        SELECT
            MAX("СР_ОЦЕНКА")
        FROM
            "УЧЕНИКИ_СО_СР_ОЦЕНКАМИ" "УЧЕНИКИ_3100"
        WHERE
            "УЧЕНИКИ_3100"."ГРУППА" = '3100'
    )
    AND "УЧЕНИКИ_4100"."ГРУППА" = '4100';