import sys
sys.path.append('..')

from part2.script import find_all_special_words
from ftest import ftest


TEST_CASES = [
    (
        'Кривошеее существо гуляет по парку',
        ['гуляет'],
    ),
    (
        'Кривошеее нечто гуляет по парку',
        ['Кривошеее', 'гуляет'],
    ),
    (
        'Кривошеее! существо, гуляет. по: парку?',
        ['гуляет'],
    ),
    (
        'гуляет',
        [],
    ),
    (    
        'ааа. еее, иии: ооо: ууу; иои! еое? аиа (оуа) уаи \'аее\" ууе',
        ['ааа', 'еее', 'иии', 'ооо', 'ууу', 'иои', 'еое', 'аиа', 'оуа', 'уаи', 'аее'],
    ),
    (
        'КрИвОшЕеЕ сУщЕсТвО гУлЯеТ пО пАрКу',
        ['гУлЯеТ'],
    ),
    (
        'Кривошеее\tсущество\tгуляет\tпо\tпарку',
        ['гуляет'],
    ),
    (
        'Кривошеёе сущёство гуляёт пё паркё',
        ['гуляёт'],
    ),
]


def test() -> None:
    ftest(find_all_special_words, TEST_CASES, test_name='Lab 3. Special word counter')


if __name__ == '__main__':
    test()
