import sys
sys.path.append('..')

from part3.joke import get_student_list_after_a_joke
from ftest import ftest


TEST_CASES = [
    (
        [
            [
                'Петров П.П. P0000',
                'Анищенко А.А. P33113',
                'Примеров Е.В. P0000',
                'Иванов И.И. P0000',
            ],
            'P0000',
        ],
        [
            'Анищенко А.А. P33113',
            'Примеров Е.В. P0000',
        ],
    ),
    (
        [
            [
                'Петров П.П. P0000',
                'Анищенко А.А. P33113',
                'Примеров Е.В. P0000',
                'Иванов И.И. P0000',
            ],
            '',
        ],
        [
            'Петров П.П. P0000',
            'Анищенко А.А. P33113',
            'Примеров Е.В. P0000',
            'Иванов И.И. P0000',
        ],
    ),
    (
        [
            [
                'Анищенко А.А. P33113',
                'Петров-Польский П.П. P0000',
            ],
            'P0000',
        ],
        [
            'Анищенко А.А. P33113',
        ],
    ),
    (
        [
            [
                'Петров С.П. P0000',
                'Анищенко А.А. P33113',
                'Примеров Е.В. P0000',
                'Иванов С.И. P0000',
            ],
            'P0000',
        ],
        [
            'Петров С.П. P0000',
            'Анищенко А.А. P33113',
            'Примеров Е.В. P0000',
            'Иванов С.И. P0000',
        ],
    ),
    (
        [
            [
                'Петров С.П. P0000',
                'Петров П.П. P0000',
                'Петров С.П. P0001',
                'Петров П.П. P0001',
            ],
            'P0000',
        ],
        [
            'Петров С.П. P0000',
            'Петров С.П. P0001',
            'Петров П.П. P0001',
        ],
    ),
]


def test() -> None:
    ftest(get_student_list_after_a_joke, TEST_CASES, test_name='Lab 3. Joking with students.')


if __name__ == '__main__':
    test()
